
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.1.163
# Date: 2025-03-21 12:31

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: T120F324
# Project: rah
# Timing Model: C3 (final)

# PLL Constraints
#################
create_clock -period 18.5185 tx_pixel_clk
create_clock -period 9.2593 tx_esc_clk
create_clock -period 9.2593 tx_vga_clk
create_clock -period 18.5185 rx_pixel_clk
create_clock -period 9.2593 mipi_rx_cal_clk

# GPIO Constraints
####################

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_rx_pin}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_rx_pin}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_tx_pin}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_tx_pin}]

# LVDS Rx Constraints
####################

# MIPI RX Constraints
#####################################
set_output_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 0.733 [get_ports {my_mipi_rx_VC_ENA[3] my_mipi_rx_VC_ENA[2] my_mipi_rx_VC_ENA[1] my_mipi_rx_VC_ENA[0]}]
set_output_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min -0.069 [get_ports {my_mipi_rx_VC_ENA[3] my_mipi_rx_VC_ENA[2] my_mipi_rx_VC_ENA[1] my_mipi_rx_VC_ENA[0]}]
set_output_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 0.147 [get_ports {my_mipi_rx_CLEAR}]
set_output_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min -0.157 [get_ports {my_mipi_rx_CLEAR}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.409 [get_ports {my_mipi_rx_VSYNC[3] my_mipi_rx_VSYNC[2] my_mipi_rx_VSYNC[1] my_mipi_rx_VSYNC[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.542 [get_ports {my_mipi_rx_VSYNC[3] my_mipi_rx_VSYNC[2] my_mipi_rx_VSYNC[1] my_mipi_rx_VSYNC[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.401 [get_ports {my_mipi_rx_HSYNC[3] my_mipi_rx_HSYNC[2] my_mipi_rx_HSYNC[1] my_mipi_rx_HSYNC[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.539 [get_ports {my_mipi_rx_HSYNC[3] my_mipi_rx_HSYNC[2] my_mipi_rx_HSYNC[1] my_mipi_rx_HSYNC[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.212 [get_ports {my_mipi_rx_VALID}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.466 [get_ports {my_mipi_rx_VALID}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.303 [get_ports {my_mipi_rx_CNT[3] my_mipi_rx_CNT[2] my_mipi_rx_CNT[1] my_mipi_rx_CNT[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.501 [get_ports {my_mipi_rx_CNT[3] my_mipi_rx_CNT[2] my_mipi_rx_CNT[1] my_mipi_rx_CNT[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.339 [get_ports {my_mipi_rx_DATA[*]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.515 [get_ports {my_mipi_rx_DATA[*]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.231 [get_ports {my_mipi_rx_ERROR[*]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.473 [get_ports {my_mipi_rx_ERROR[*]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.228 [get_ports {my_mipi_rx_ULPS_CLK}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.472 [get_ports {my_mipi_rx_ULPS_CLK}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -max 1.240 [get_ports {my_mipi_rx_ULPS[3] my_mipi_rx_ULPS[2] my_mipi_rx_ULPS[1] my_mipi_rx_ULPS[0]}]
set_input_delay -clock rx_pixel_clk -reference_pin [get_ports {rx_pixel_clk~CLKOUT~337~581}] -min 0.477 [get_ports {my_mipi_rx_ULPS[3] my_mipi_rx_ULPS[2] my_mipi_rx_ULPS[1] my_mipi_rx_ULPS[0]}]

# MIPI TX Constraints
#####################################
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.611 [get_ports {my_mipi_tx_LANES[1] my_mipi_tx_LANES[0]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.001 [get_ports {my_mipi_tx_LANES[1] my_mipi_tx_LANES[0]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.276 [get_ports {my_mipi_tx_VSYNC}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.105 [get_ports {my_mipi_tx_VSYNC}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.274 [get_ports {my_mipi_tx_HSYNC}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.077 [get_ports {my_mipi_tx_HSYNC}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.332 [get_ports {my_mipi_tx_VALID}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.062 [get_ports {my_mipi_tx_VALID}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.498 [get_ports {my_mipi_tx_DATA[*]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.211 [get_ports {my_mipi_tx_DATA[*]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.751 [get_ports {my_mipi_tx_TYPE[*]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.129 [get_ports {my_mipi_tx_TYPE[*]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.107 [get_ports {my_mipi_tx_FRAME_MODE}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.110 [get_ports {my_mipi_tx_FRAME_MODE}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.152 [get_ports {my_mipi_tx_ULPS_CLK_ENTER}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.108 [get_ports {my_mipi_tx_ULPS_CLK_ENTER}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.126 [get_ports {my_mipi_tx_ULPS_CLK_EXIT}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.113 [get_ports {my_mipi_tx_ULPS_CLK_EXIT}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.387 [get_ports {my_mipi_tx_ULPS_ENTER[3] my_mipi_tx_ULPS_ENTER[2] my_mipi_tx_ULPS_ENTER[1] my_mipi_tx_ULPS_ENTER[0]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.131 [get_ports {my_mipi_tx_ULPS_ENTER[3] my_mipi_tx_ULPS_ENTER[2] my_mipi_tx_ULPS_ENTER[1] my_mipi_tx_ULPS_ENTER[0]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -max 0.478 [get_ports {my_mipi_tx_ULPS_EXIT[3] my_mipi_tx_ULPS_EXIT[2] my_mipi_tx_ULPS_EXIT[1] my_mipi_tx_ULPS_EXIT[0]}]
set_output_delay -clock tx_pixel_clk -reference_pin [get_ports {tx_pixel_clk~CLKOUT~337~606}] -min -0.138 [get_ports {my_mipi_tx_ULPS_EXIT[3] my_mipi_tx_ULPS_EXIT[2] my_mipi_tx_ULPS_EXIT[1] my_mipi_tx_ULPS_EXIT[0]}]
